In [5]:
import pandas as pd
import numpy as np

In [4]:
df=pd.read_csv("placement.csv")
df.head()

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0

In [6]:
df.isnull().sum() #Help to get the no. of null values

sl_no              0
gender             0
ssc_p              0
ssc_b              0
hsc_p              0
hsc_b              0
hsc_s              0
degree_p           0
degree_t           0
workex             0
etest_p            0
specialisation     0
mba_p              0
status             0
salary            67
dtype: int64

In [8]:
df["salary"]=df["salary"].fillna(df["salary"].mode()[0])  #filling null values with mode
df.isnull().sum() #Help to get the no. of null values

sl_no             0
gender            0
ssc_p             0
ssc_b             0
hsc_p             0
hsc_b             0
hsc_s             0
degree_p          0
degree_t          0
workex            0
etest_p           0
specialisation    0
mba_p             0
status            0
salary            0
dtype: int64

In [2]:
from sklearn.impute import SimpleImputer

In [14]:
imputer=SimpleImputer(missing_values=np.nan,strategy="mean")
df=pd.DataFrame({"Mayank":[3,4,2,np.nan,2,3,7,4,np.nan]})
df

   Mayank
0     3.0
1     4.0
2     2.0
3     NaN
4     2.0
5     3.0
6     7.0
7     4.0
8     NaN

In [16]:
imputer=imputer.fit(df)

df=imputer.transform(df)

df

array([[3.        ],
       [4.        ],
       [2.        ],
       [3.57142857],
       [2.        ],
       [3.        ],
       [7.        ],
       [4.        ],
       [3.57142857]])